narmesk/testjules1/PIC18FREMOTE/glcd.c
    LATD = data;        // Veri Byte'ını Data Bus'a Koy
    RS_SetHigh();       // RS = 1 (Veri Modu)
    __delay_us(1);

    EN_SetHigh();       // EN = 1 (Enable Strobe YÜKSEK)
    __delay_us(2);
    EN_SetLow();        // EN = 0 (Enable Strobe DÜŞÜK - Düşen Kenarda Yazılır)
    __delay_us(2);

    BUFEN_SetHigh();    // BUFEN Deaktif
    BUFE2_SetHigh();    // BUFE2 Deaktif
}

void GLCD_Data(char Data)
{
    GLCD_Data_Direct((unsigned char)Data);
}

//-------------------------------------------------------------------------------------------------
// GLCD Başlatma Fonksiyonu
//-------------------------------------------------------------------------------------------------
void GLCD_Init(void)
{
    ANSELD = 0x00;              // PORTD Dijital Mod
    TRISD = 0x00;               // Data Bus Çıkış
    BUFE2_SetHigh();            // BUFE2 Deaktif

    GLCD_Chip_Select_Direct(4); // Tüm Çipleri Seç
    __delay_ms(10);

    GLCD_Command_Direct(DISPLAY_OFF_CMD);           // Ekran Kapalı (0x3E)
    GLCD_Command_Direct(DISPLAY_SET_Y_CMD | 0);     // Column = 0
    GLCD_Command_Direct(DISPLAY_SET_X_CMD | 0);     // Page = 0
    GLCD_Command_Direct(DISPLAY_START_LINE_CMD | 0);// Start Line = 0
    GLCD_Command_Direct(DISPLAY_ON_CMD);            // Ekran Açık (0x3F)

    GLCD_Chip_Select_Direct(0); // Seçimleri Kaldır
    GLCD_ClearAll();            // Ekrana İlk Temizlik
}

//-------------------------------------------------------------------------------------------------
// Tüm RAM Tamponunu Ekrana Yansıtma (Aşırı Hızlı Tek Geçişli Render)
//-------------------------------------------------------------------------------------------------
void GLCD_Render(void)
{
    unsigned char page, col;
    unsigned short ptr;

    for (page = 0; page < 8; page++)
    {
        ptr = page * 192;

        // Çip 1 (Sol 64 Sütun)
        GLCD_Chip_Select_Direct(1);
        GLCD_Command_Direct(DISPLAY_SET_X_CMD | page);
        GLCD_Command_Direct(DISPLAY_SET_Y_CMD | 0);
        for (col = 0; col < 64; col++)
        {
            GLCD_Data_Direct(glcd_buffer[ptr + col]);
        }

        // Çip 2 (Orta 64 Sütun)
        GLCD_Chip_Select_Direct(2);
        GLCD_Command_Direct(DISPLAY_SET_X_CMD | page);
        GLCD_Command_Direct(DISPLAY_SET_Y_CMD | 0);
        for (col = 0; col < 64; col++)
        {
            GLCD_Data_Direct(glcd_buffer[ptr + 64 + col]);
        }

        // Çip 3 (Sağ 64 Sütun)
        GLCD_Chip_Select_Direct(3);
        GLCD_Command_Direct(DISPLAY_SET_X_CMD | page);
        GLCD_Command_Direct(DISPLAY_SET_Y_CMD | 0);
        for (col = 0; col < 64; col++)
        {
            GLCD_Data_Direct(glcd_buffer[ptr + 128 + col]);
        }
    }
    GLCD_Chip_Select_Direct(0);
}

//-------------------------------------------------------------------------------------------------
// GLCD Tüm Ekranı Temizleme (RAM Buffera Yazıp Donanıma Anında Yansıtma)
//-------------------------------------------------------------------------------------------------
void GLCD_ClearAll(void)
{
    memset(glcd_buffer, 0x00, 1536);
    GLCD_Render();
}

//-------------------------------------------------------------------------------------------------
// GLCD Doğrudan Konumlandırma (x: 0..191 piksel, page: 0..7 sayfa adresi)
//-------------------------------------------------------------------------------------------------
void GLCD_GoTo_Direct(unsigned char x, unsigned char page)
{
    unsigned char chip;
    unsigned char column;

    if (x >= 192 || page >= 8) return;

    chip = (x / 64) + 1; // 1: Sol (0..63), 2: Orta (64..127), 3: Sağ (128..191) Çip
    column = x % 64;     // Çip içi sütun adresi (0..63)

    GLCD_Chip_Select_Direct(chip);
    GLCD_Command_Direct(DISPLAY_SET_X_CMD | page);   // Page (0xB8 + page)
    GLCD_Command_Direct(DISPLAY_SET_Y_CMD | column); // Sütun (0x40 + column)
}

void GLCD_GoTo(unsigned char x, unsigned char y)
{
    screen_x = x;
    screen_y = y;
    GLCD_GoTo_Direct(x, (y >= 8) ? (y / 8) : y);
}

void GLCD_WriteData(unsigned char dataToWrite)
{
    unsigned char page = screen_y / 8;
    unsigned short idx = (unsigned short)page * 192 + screen_x;

    if (screen_x < 192 && page < 8)
    {
        glcd_buffer[idx] = dataToWrite;
        GLCD_GoTo_Direct(screen_x, page);
        GLCD_Data_Direct(dataToWrite);
        GLCD_Chip_Select_Direct(0);
    }
    screen_x++;
}

void GLCDWriteData(unsigned char data)
{
    unsigned char page = Coord.y / 8;
    unsigned short idx = (unsigned short)page * 192 + Coord.x;

    if (Coord.x < 192 && page < 8)
    {
        glcd_buffer[idx] = data;
        GLCD_GoTo_Direct(Coord.x, page);
        GLCD_Data_Direct(data);
        GLCD_Chip_Select_Direct(0);
    }
    Coord.x++;
}

void GotoXY(unsigned char x, unsigned char y)
{
    Coord.x = x;
    Coord.y = y;
}

//-------------------------------------------------------------------------------------------------
// MCU RAM Tamponu Kullanan Hızlı ve Güvenilir Grafik Çizim Fonksiyonları
//-------------------------------------------------------------------------------------------------

// Tek Piksel Çizimi / Silimi (RAM Buffera Yazıp Donanıma Anında Yansıtma)
void GLCD_SetPixel(unsigned char x, unsigned char y, unsigned char color)
{
    unsigned char page = y / 8;
    unsigned char bit_pos = y % 8;
    unsigned short idx;

    if (x >= 192 || y >= 64) return;

    idx = (unsigned short)page * 192 + x;

    if (color == BLACK)
    {
        glcd_buffer[idx] |= (1 << bit_pos);
    }
    else
    {
        glcd_buffer[idx] &= ~(1 << bit_pos);
    }

    // Donanıma anında yeni byte değerini yansıt (Okuma olmadan!)
    GLCD_GoTo_Direct(x, page);
    GLCD_Data_Direct(glcd_buffer[idx]);
    GLCD_Chip_Select_Direct(0);
}

// Çerçeve Dikdörtgen Çizimi
void GLCD_Rectangle(unsigned char x, unsigned char y, unsigned char b, unsigned char a, unsigned char color)
{
    unsigned char j;
    for (j = x; j <= b; j++)
    {
        GLCD_SetPixel(j, y, color);
        GLCD_SetPixel(j, a, color);
    }
    for (j = y; j <= a; j++)
    {
        GLCD_SetPixel(x, j, color);
        GLCD_SetPixel(b, j, color);
    }
}

// Dolu Dikdörtgen Çizimi (RAM Buffera Hızlıca İşleyip Ekranı Güncelleme)
void GLCD_Rectangle_Fill(unsigned char x, unsigned char y, unsigned char b, unsigned char a, unsigned char color)
{
    unsigned char curr_x, curr_y;
    for (curr_x = x; curr_x <= b; curr_x++)
    {
        for (curr_y = y; curr_y <= a; curr_y++)
        {
            GLCD_SetPixel(curr_x, curr_y, color);
        }
    }
}

// Alan Doldurma
void SetPixels(unsigned char x, unsigned char y, unsigned char x2, unsigned char y2, unsigned char color)
{
    GLCD_Rectangle_Fill(x, y, x2, y2, color);
}

// Çizgi Çizimi
void GLCD_Line(unsigned char X1, unsigned char Y1, unsigned char X2, unsigned char Y2, unsigned char color)
{
    int CurrentX, CurrentY, Xinc, Yinc,
            Dx, Dy, TwoDx, TwoDy,
            TwoDxAccumulatedError, TwoDyAccumulatedError;

    Dx = (X2 - X1);
    Dy = (Y2 - Y1);

